Revit 2026 API

# CurveUV Class

---

A class that encapsulates the notion of a curve in the 2D parameter space of a surface in 3D space.

SystemObject Autodesk.Revit.DBCurveUV

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveUV : IDisposable
```
```vb
Public Class CurveUV
	Implements IDisposable
```
```cpp
public ref class CurveUV : IDisposable
```
```fsharp
type CurveUV =
    class
        interface IDisposable
    end
```

The CurveUV type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsBound | Describes whether the parameter of the curve is restricted to a particular interval. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | As3DCurveInXYPlane | Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates. |
|  | ComputeDerivatives | Computes the first derivative, the second derivative and the unit tangent vector at the specified parameter along the curve. |
|  | Create | Create a CurveUV from a bounded 3D Curve lying in the XY plane. |
|  | Dispose | Releases all resources used by the CurveUV |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Evaluate | Evaluates and returns the point at the specified parameter along the curve. |
|  | GetEndParameter | Gets the raw parameter value at the start or end of this curve. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | Transform | Transform this CurveUV by the given 2D affine transform if possible. |

Revit does not have a class to represent 2D curves explicitly.

#### Reference

Autodesk.Revit.DB Namespace